; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v6)
             (pred_2 ?v13 ?v4)
             (pred_4 ?v3 ?v4)
             (pred_5 ?v1 ?v3 )
	     (pred_1 ?v3)
             (pred_10 ?v11)
             (pred_11 ?v13)
             (pred_3 ?v4)
             (pred_9 ?v3)
             (pred_7 ?v13)
             (pred_12 ?v3)
             (pred_6 ))



(:action op_3
:parameters (?v9 ?v7 ?v2 ?v12)
:precondition (and (pred_10 ?v9) (pred_10 ?v7) (pred_11 ?v2) (pred_3 ?v12)
          (pred_8 ?v9 ?v7) (pred_2 ?v2 ?v12)
                   (pred_4 ?v7 ?v12) (pred_1 ?v9) 
                   (pred_9 ?v7) (pred_7 ?v2))
:effect (and  (pred_12 ?v7) (not (pred_9 ?v7))))


(:action op_2
:parameters (?v9 ?v5)
:precondition (and (pred_10 ?v9) (pred_10 ?v5)
               (pred_1 ?v9) (pred_8 ?v9 ?v5) (pred_12 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v9))))

(:action op_1
:parameters (?v9 ?v2)
:precondition (and (pred_10 ?v9) (pred_11 ?v2) 
                  (pred_1 ?v9) (pred_5 ?v2 ?v9) (pred_6 ))
:effect (and (pred_7 ?v2)
   (not (pred_5 ?v2 ?v9)) (not (pred_6 ))))


(:action op_4
:parameters (?v9 ?v8 ?v10)
:precondition (and (pred_10 ?v9) (pred_11 ?v8) (pred_11 ?v10)
                  (pred_1 ?v9) (pred_7 ?v10) (pred_5 ?v8 ?v9))
:effect (and (pred_7 ?v8) (pred_5 ?v10 ?v9)
        (not (pred_7 ?v10)) (not (pred_5 ?v8 ?v9))))

(:action op_5
:parameters (?v9 ?v2)
:precondition (and (pred_10 ?v9) (pred_11 ?v2) 
                  (pred_1 ?v9) (pred_7 ?v2))
:effect (and (pred_6 ) (pred_5 ?v2 ?v9) (not (pred_7 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_18 obj_02 obj_13 obj_15 obj_09 obj_14 obj_10 obj_11 obj_04 obj_20 obj_19 obj_17 obj_01 obj_03 obj_05
    obj_21 obj_08
    obj_12 obj_07 obj_06
    )

    (:init
       (pred_6)

       (pred_10 obj_16)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_10 obj_15)
       (pred_10 obj_09)
       (pred_10 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_04)
       (pred_10 obj_20)
       (pred_10 obj_19)
       (pred_10 obj_17)
       (pred_10 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_05)
       (pred_3 obj_21)
       (pred_3 obj_08)
       (pred_11 obj_12)
       (pred_11 obj_07)
       (pred_11 obj_06)

       (pred_8 obj_16 obj_15)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_18 obj_09)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_13 obj_10)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_15 obj_09)
       (pred_8 obj_15 obj_16)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_09 obj_18)
       (pred_8 obj_09 obj_15)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_04 obj_01)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_20 obj_19)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_19 obj_05)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_20)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_01 obj_04)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_03 obj_05)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_05 obj_19)
       (pred_8 obj_05 obj_03)
       (pred_9 obj_15)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_4  obj_15 obj_21)
       (pred_4  obj_02 obj_08)
       (pred_4  obj_17 obj_21)
       (pred_12 obj_16)
       (pred_12 obj_18)
       (pred_12 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_05)

       (pred_2  obj_12 obj_21)
       (pred_2  obj_07 obj_08)
       (pred_2  obj_06 obj_21)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_07 obj_14)
       (pred_5 obj_06 obj_10)
       (pred_1 obj_05)
    )

    (:goal (and
       (pred_5 obj_12 obj_16)
    ))
(:constraints
  (always (not (pred_1 obj_19)))
)
)

; plan
1. (op_2 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_03)
   goals met: 0 of 1
2. (op_2 obj_03 obj_20)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_20)
   goals met: 0 of 1
3. (op_2 obj_20 obj_14)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_14)
   goals met: 0 of 1
4. (op_2 obj_14 obj_10)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_10)
   goals met: 0 of 1
5. (op_2 obj_10 obj_13)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_13)
   goals met: 0 of 1
6. (op_1 obj_13 obj_12)
   deleted: (pred_5 obj_12 obj_13) (pred_6)
   added: (pred_7 obj_12)
   goals met: 0 of 1
7. (op_2 obj_13 obj_10)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_10)
   goals met: 0 of 1
8. (op_2 obj_10 obj_14)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_14)
   goals met: 0 of 1
9. (op_2 obj_14 obj_09)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_09)
   goals met: 0 of 1
10. (op_2 obj_09 obj_18)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_18)
   goals met: 0 of 1
11. (op_2 obj_18 obj_16)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_16)
   goals met: 0 of 1
12. (op_5 obj_16 obj_12)
   deleted: (pred_7 obj_12)
   added: (pred_6) (pred_5 obj_12 obj_16)
   goals met: 1 of 1
